# Дано число. Проверьте, четное оно или нет.

number = int(input('Введите число\n'))

if number % 2 == 0:
	print('Число четное')
else:
	print('Число нечетное')
