# Дана строка. Выведите в консоль последний символ строки.

str = input('Введите строку\n')
print(str[-1])